def area(a):
    '''
    Возвращает площадь квадрата со стороной a

            Параметры:
                    a (int): длина стороны квадрата

            Возвращаемое значение:
                    a * a (int): площадь квадрата
    '''
    return a * a


def perimeter(a):
    '''
    Возвращает периметр квадрата со стороной a

            Параметры:
                    a (int): длина стороны квадрата

            Возвращаемое значение:
                    4 * a (int): периметр квадрата
    '''
    return 4 * a
